RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_processing.c
    /* Reset debounce counters */
    switch (ptrWdCfg->wdType)
    {
        #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_BUTTON_EN) ||\
            (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MATRIX_EN))
            case (uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E:
            case (uint8_t)CY_CAPSENSE_WD_BUTTON_E:
                /* Each button requires one debounce counter */
                (void)memset(ptrWdCfg->ptrDebounceArr, (int32_t)ptrWdCxt->onDebounce, (size_t)snsNumber);
                break;
        #endif
        #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_SLIDER_EN) ||\
            (CY_CAPSENSE_DISABLE != CY_CAPSENSE_TOUCHPAD_EN))
            case (uint8_t)CY_CAPSENSE_WD_LINEAR_SLIDER_E:
            case (uint8_t)CY_CAPSENSE_WD_RADIAL_SLIDER_E:
            case (uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E:
                /* Each widget requires one debounce counter */
                if (ptrWdCfg->senseMethod == CY_CAPSENSE_CSD_GROUP)
                {
                    *(ptrWdCfg->ptrDebounceArr) = ptrWdCxt->onDebounce;
                }
                else
                {
                    /*
                    * CSX Touchpad has debounce located in another place. Moreover,
                    * debounce counter is initialized at ID assignment, so no need
                    * to do it here.
                    */
                }
                break;
        #endif
        #if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_PROXIMITY_EN)
            case (uint8_t)CY_CAPSENSE_WD_PROXIMITY_E:
                /* Proximity widgets have 2 debounce counters per sensor (for touch and prox detection) */
                (void)memset(ptrWdCfg->ptrDebounceArr, (int32_t)ptrWdCxt->onDebounce, (size_t)(snsNumber << 1u));
                break;
        #endif
        default:
            /* No other widget types */
            break;
    }

    /* Reset touch numbers */
    #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_TOUCHPAD_EN) ||\
        (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MATRIX_EN) ||\
        (CY_CAPSENSE_DISABLE != CY_CAPSENSE_SLIDER_EN))
        switch (ptrWdCfg->wdType)
        {
            case (uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E:
            case (uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E:
            case (uint8_t)CY_CAPSENSE_WD_LINEAR_SLIDER_E:
            case (uint8_t)CY_CAPSENSE_WD_RADIAL_SLIDER_E:
                /* Clean number of touches */
                ptrWdCxt->wdTouch.numPosition = CY_CAPSENSE_POSITION_NONE;
                if (0u != (ptrWdCfg->posFilterConfig & CY_CAPSENSE_POSITION_FILTERS_MASK))
                {
                    ptrWdCfg->ptrPosFilterHistory->numPosition = CY_CAPSENSE_POSITION_NONE;
                }
                break;
            default:
                /* No action on other widget types */
                break;
        }
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_BALLISTIC_MULTIPLIER_EN)
        /* Reset ballistic displacement */
        if (0u != (ptrWdCfg->centroidConfig & CY_CAPSENSE_CENTROID_BALLISTIC_MASK))
        {
            ptrWdCxt->xDelta = 0;
            ptrWdCxt->yDelta = 0;
            ptrWdCfg->ptrBallisticContext->oldTouchNumber = 0u;
        }
    #endif

    /* Reset touch history */
    if (0u != (ptrWdCfg->posFilterConfig & CY_CAPSENSE_POSITION_FILTERS_MASK))
    {
        #if(CY_CAPSENSE_DISABLE != CY_CAPSENSE_TOUCHPAD_EN)
            switch (ptrWdCfg->wdType)
            {
                case (uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E:
                    /* Clean position filter history */
                    if (ptrWdCfg->senseMethod == CY_CAPSENSE_CSX_GROUP)
                    {
                        /* Reset all history IDs to undefined state */
                        ptrHistory = ptrWdCfg->ptrPosFilterHistory->ptrPosition;
                        filterSize = (ptrWdCfg->posFilterConfig & CY_CAPSENSE_POSITION_FILTERS_SIZE_MASK) >> CY_CAPSENSE_POSITION_FILTERS_SIZE_OFFSET;
                        for (snsIndex = 0u; snsIndex < CY_CAPSENSE_MAX_CENTROIDS; snsIndex++)
                        {
                            ptrHistory->id = CY_CAPSENSE_CSX_TOUCHPAD_ID_UNDEFINED;
                            ptrHistory += filterSize;
                        }
                    }
                    break;
                default:
                    /* No action on other widget types */
                    break;
            }
        #endif

        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ADAPTIVE_FILTER_EN)
            /* Init Adaptive IIR filter */
            if (0u != (ptrWdCfg->posFilterConfig & CY_CAPSENSE_POSITION_AIIR_MASK))
            {
                Cy_CapSense_AdaptiveFilterInitialize_Lib(&ptrWdCfg->aiirConfig,
                                                         ptrWdCfg->ptrPosFilterHistory->ptrPosition);
            }
        #endif
    }
}

#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_GESTURE_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_InitializeWidgetGestures
****************************************************************************//**
*
* Performs initialization of all gestures for the specified widget.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeWidgetGestures(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdCfg->ptrWdContext;

    if (((uint8_t)CY_CAPSENSE_WD_LINEAR_SLIDER_E == ptrWdCfg->wdType) ||
        ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType))
    {
        if (NULL != ptrWdCfg->ptrGestureConfig)
        {
            if (0u != (ptrWdCfg->ptrGestureConfig->gestureEnableMask & CY_CAPSENSE_GESTURE_ALL_GESTURES_MASK))
            {
                ptrWdCxt->gestureDetected = 0u;
                ptrWdCxt->gestureDirection = 0u;
                Cy_CapSense_Gesture_ResetState(ptrWdCfg->ptrGestureContext);
            }
        }
    }
}


