RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_processing.c
        for(freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
        {
            ceIdx = (uint32_t)ptrWdCfg->numRows * ptrWdCfg->numCols;
            while (ceIdx >= mptxOrderLocal)
            {
                ceIdx -= mptxOrderLocal;
                /* Copy vector formed by RX[rxIdx] and TX[txIdx..txIdx+mptxOrderLocal]
                * from sensors to localBuf */
                idx = mptxOrderLocal;
                while (0u != idx--)
                {
                    localBuf[idx] = (int32_t)ptrWdCfg->ptrSnsContext[idx + ceIdx +
                                    (context->ptrCommonConfig->numSns * freqChIndex)].raw;
                }

                /* Multiply vector stored in localBuf by the matrix of deconvolution coefficients. */
                idx = mptxOrderLocal;
                while (0u != idx--)
                {
                    accum = 0;
                    rotIdx = idx + mptxOrderLocal - 1u;
                    sumIdx = mptxOrderLocal;
                    while (0u != sumIdx--)
                    {
                        accum += localBuf[sumIdx] * deconvCoefRot[rotIdx];
                        rotIdx--;
                    }

                    if (0 > accum)
                    {
                        accumTmp = 0u;
                    }
                    else
                    {
                        accumTmp = (uint32_t)accum;

                        /* Shift the result in such a way that guarantees no overflow */
                        accumTmp >>= CY_CAPSENSE_SCALING_SHIFT;

                        if ((uint32_t)UINT16_MAX < accumTmp)
                        {
                            accumTmp = UINT16_MAX;
                        }
                    }

                    /* Convert the result to unsigned 16 bit and store in the target buffer */
                    ptrWdCfg->ptrSnsContext[idx + ceIdx +
                                    (context->ptrCommonConfig->numSns * freqChIndex)].raw = (uint16_t)accumTmp;
                }
            }
        }
    }
    return result;
}
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_PreProcessWidget
****************************************************************************//**
*
* Executes the pre-processing of scan raw data for specified widgets.
*
* This function is called prior any other processing function for
* the fifth CAPSENSE&trade; HW generation. The pre-processing routine implements
* the following operations:
* - Executes the CIC2 pre-processing if the filter mode is set to CIC2.
* - Limits raw count to maximum value.
* - Executes the raw data inversion for the CSX sensors.
*
* No need to call this function from application layer since the
* Cy_CapSense_ProcessAllWidgets() and Cy_CapSense_ProcessWidget() functions
* calls it automatically.
*
* If specific processing is implemented using the Cy_CapSense_ProcessWidgetExt()
* and Cy_CapSense_ProcessSensorExt() function then a call of this function is
* required prior doing the specific processing. If Multi-phase TX is enabled
* then deconvolution should be executed after call of this function using
* the Cy_CapSense_ProcessWidgetMptxDeconvolution() function.
*
* \param widgetId
* The widget ID, for which the pre-processing should be executed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_PreProcessWidget(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context)
{
    /* Adjusts raw count if CIC2 enabled */
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN)
        Cy_CapSense_PreProcessWidgetCic2Raw(widgetId, context);
    #endif

    /* Limit raw count to the maximum possible raw count value */
    Cy_CapSense_PreProcessWidgetLimitRaw(widgetId, context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        /* Inverts raw count for CSX widgets */
        if(CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[widgetId].senseMethod)
        {
            Cy_CapSense_PreProcessWidgetInvertRaw(widgetId, context);
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */
}


/*******************************************************************************
* Function Name: Cy_CapSense_PreProcessSensor
****************************************************************************//**
*
* Executes the pre-processing of scan raw data for specified sensor.
*
* This function is called prior any other processing function for
* the fifth CAPSENSE&trade; HW generation. The pre-processing routine implements
* the following operations:
* - Executes the CIC2 pre-processing if the filter mode is set to CIC2.
* - Limits raw count to maximum value.
* - Executes the raw data inversion for the CSX sensors.
*
* No need to call this function from application layer since the
* Cy_CapSense_ProcessAllWidgets() and Cy_CapSense_ProcessWidget() functions
* calls it automatically.
*
* If specific processing is implemented using the Cy_CapSense_ProcessWidgetExt()
* and Cy_CapSense_ProcessSensorExt() function then a call of this function is
* required prior doing the specific processing. If Multi-phase TX is enabled
* then deconvolution should be executed after pre-processing of all sensors
* of the specified widget using the Cy_CapSense_ProcessWidgetMptxDeconvolution()
* function.
*
* \param widgetId
* The widget ID, for which the pre-processing should be executed.
*
* \param sensorId
* The sensor ID, for which the pre-processing should be executed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_PreProcessSensor(
                uint32_t widgetId,
                uint32_t sensorId,
                const cy_stc_capsense_context_t * context)
{
    /* Adjusts raw count if CIC2 enabled */
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN)
        Cy_CapSense_PreProcessSensorCic2Raw(widgetId, sensorId, context);
    #endif

    /* Limit raw count to the maximum possible raw count value */
    Cy_CapSense_PreProcessSensorLimitRaw(widgetId, sensorId, context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        /* Inverts raw count for CSX widgets */
        if(CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[widgetId].senseMethod)
        {
            Cy_CapSense_PreProcessSensorInvertRaw(widgetId, sensorId, context);
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */
}


