RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_processing.c
/*******************************************************************************
* Function Name: Cy_CapSense_PreProcessSensorCic2Raw
****************************************************************************//**
*
* This internal function executes the pre-processing of raw data
* produced by the fifth CAPSENSE&trade; HW generation with the filter mode set
* to CIC2.
*
* \param widgetId
* The widget ID, for which the pre-processing should be executed.
*
* \param sensorId
* The sensor ID, for which the pre-processing should be executed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_PreProcessSensorCic2Raw(
                uint32_t widgetId,
                uint32_t sensorId,
                const cy_stc_capsense_context_t * context)
{
    uint32_t tmpVal;
    uint32_t clkDivider;
    uint32_t cic2Samples;
    uint32_t cic2Divider;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = &ptrWdCfg->ptrSnsContext[sensorId];

    clkDivider = context->ptrWdContext[widgetId].snsClk;
    if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) && (ptrWdCfg->numCols <= sensorId))
    {
        clkDivider = context->ptrWdContext[widgetId].rowSnsClk;
    }

    cic2Samples = ((clkDivider * ptrWdCfg->ptrWdContext->numSubConversions /
                    ptrWdCfg->ptrWdContext->cicRate) - 1u) * ptrWdCfg->numChopCycles;
    cic2Divider = Cy_CapSense_GetCIC2HwDivider(cic2Samples);

    tmpVal = ((uint32_t)ptrSnsCxt->raw * cic2Divider) / cic2Samples;
    if (tmpVal > CY_CAPSENSE_16_BIT_MASK)
    {
        tmpVal = CY_CAPSENSE_16_BIT_MASK;
    }
    ptrSnsCxt->raw = (uint16_t)tmpVal;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetCIC2HwDivider
****************************************************************************//**
*
* This internal function determines the value of the divider that will be
* applied to the data, accumulated by the CIC2 HW for the specified number of
* samples.
*
* \param cic2Samples
* The number of CIC2 samples for the specified sensing parameters. This value
* can be obtained by using the Cy_CapSense_GetCIC2SamplesNum function.
*
* \return
* The CIC2 HW divider value.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetCIC2HwDivider(
                uint32_t cic2Samples)
{
    uint32_t cic2Divider;

    if(cic2Samples > CY_CAPSENSE_CIC2_DIVIDER_8)
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_16;
    }
    else if(cic2Samples > CY_CAPSENSE_CIC2_DIVIDER_4)
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_8;
    }
    else if(cic2Samples > CY_CAPSENSE_CIC2_DIVIDER_2)
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_4;
    }
    else if(cic2Samples > CY_CAPSENSE_CIC2_DIVIDER_1)
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_2;
    }
    else
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_1;
    }

    return(cic2Divider);
}
#endif /* #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_RunMfsMedian
****************************************************************************//**
*
* Applies the median filter to the specified multi-frequency widget and updates
* the specified widget diff counts.
*
* This function is a low-level function and is called automatically by
* high-level processing functions like Cy_CapSense_ProcessWidget()
* and Cy_CapSense_ProcessAllWidgets().
*
* It is not recommended to use this function directly on application level.
*
* The function applies the median filter to diff count of each sensor of the
* specified widget (with enabled multi-frequency feature) and update the diff
* count of the specified main widget.
*
* This function is needed to implement customer-specific use cases.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the widget processing:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is successfully completed
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid
* either widgetId is not valid or multi-frequency is not enabled for this widget
* or the specified widgetId is derivative of the main widget.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_RunMfsMedian(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_BAD_PARAM;

    uint32_t snsIndex;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt0;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt1;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt2;

    /* Check parameter validity */
    if (widgetId < context->ptrCommonConfig->numWd)
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];
        ptrSnsCxt0 = ptrWdCfg[CY_CAPSENSE_MFS_CH0_INDEX].ptrSnsContext;
        ptrSnsCxt1 = ptrWdCfg[CY_CAPSENSE_MFS_CH1_INDEX].ptrSnsContext;
        ptrSnsCxt2 = ptrWdCfg[CY_CAPSENSE_MFS_CH2_INDEX].ptrSnsContext;

        if (((ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_EN_MASK) != 0u) &&
            ((ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_MASK) == 0u))
        {
            /* Calculate median */
            for (snsIndex = ptrWdCfg->numSns; snsIndex-- > 0u;)
            {
                ptrSnsCxt0->diff = (uint16_t)Cy_CapSense_FtMedian(ptrSnsCxt0->diff,
                                                                  ptrSnsCxt1->diff,
                                                                  ptrSnsCxt2->diff);
                ptrSnsCxt0++;
                ptrSnsCxt1++;
                ptrSnsCxt2++;
            }
            result = CY_CAPSENSE_STATUS_SUCCESS;
        }
    }

    return (result);
}
#endif

#endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN */

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3)) */


/* [] END OF FILE */
